{"Question 1: Tell something about yourself, Walk us through your resume": ["Thank you for the opportunity to interview for the Software Engineer position at Google. I'm Diya and I'm a Software Engineer with 3 years of experience in the tech industry. In my previous role at Amazon, I was responsible for developing and maintaining large-scale distributed systems. I have a proven track record of success in building and deploying reliable and scalable software. For example, I led the development of a new feature that increased user engagement by 10%. I'm also skilled in Python, Java, and C++. I'm a highly motivated and results-oriented individual, and I'm confident that I have the skills and experience necessary to be successful in this role. I'm excited about the opportunity to join Google because I'm passionate about building innovative products that make a difference in the world. I'm also impressed by Google's commitment to engineering excellence and its culture of innovation. I'm confident that I can make a significant contribution to your team and I'm eager to learn more about the Software Engineer position. Thank you for your time and consideration."], 
"Question 2: Why should we hire you?": ["I have great communication skills, desired experience and the requisite skill set for this job role. If I get a chance to showcase my abilities, I will leave no stone unturned with my commitment to hard work and dedication."], 
"Question 3: Where Do You See Yourself Five Years From Now?": ["I am certain that the coming five years will be productive. For me, working in an esteemed organization with a positive work environment can be rewarding. I can picture myself growing to the position I'm working on. I feel values of this organization can be advantages to my career. In return, I see myself utilizing my knowledge to yield better outcomes. The five years, I see ahead of me are full of responsibilities which need better decisiveness. I'm sure the years will be mutually progressive for me and the organization."]}